CaseLabGreenatom/src/Documents/РеализацияТоваров/РеализацияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваров</name>
  <basedOn>Document.ПоступлениеТоваров</basedOn>
  <registerRecords>AccumulationRegister.Доставки</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурьерскаяСлужба</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Самовывоз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказВЗале</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусЗаказаПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Позиции</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

CaseLabGreenatom/src/InformationRegisters/Промо/Промо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Промо</name>
  <resources>
    <name>ТекстПромо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

CaseLabGreenatom/src/Catalogs/РеквизитыОрганизации/РеквизитыОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РеквизитыОрганизации</name>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетныйСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорреспондентскийСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БИК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сайт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

CaseLabGreenatom/src/Documents/РеализацияТоваров/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции 

Процедура Печать(ТабДок, Ссылка) Экспорт
	
	ЗначениеКонстанты = Константы.ИспользоватьПромоНаСкидки.Получить();
		
	Если ЗначениеКонстанты = Истина Тогда
		
		НачальныйНомер = 1;
		
	Иначе 
		
		НачальныйНомер = 11;
		
	КонецЕсли;
	
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	НомерПромо = ГСЧ.СлучайноеЧисло(НачальныйНомер, 17);
		
	Макет = Документы.РеализацияТоваров.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваров.Дата КАК Дата,
	|	РеализацияТоваров.Номер КАК Номер,
	|	РеализацияТоваров.Позиции.(
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма,
	|		Скидка КАК Скидка
	|	) КАК Позиции,
	|	РеквизитыОрганизации.Наименование КАК Наименование,
	|	РеквизитыОрганизации.ИНН КАК ИНН,
	|	РеквизитыОрганизации.Адрес КАК Адрес,
	|	РеквизитыОрганизации.Сайт КАК Сайт,
	|	РеквизитыОрганизации.Телефон КАК Телефон,
	|	Промо.ТекстПромо КАК ТекстПромо
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализацияТоваров,
	|	Справочник.РеквизитыОрганизации КАК РеквизитыОрганизации,
	|	РегистрСведений.Промо КАК Промо
	|ГДЕ
	|	РеализацияТоваров.Ссылка В(&Ссылка)
	|	И Промо.Номер = &НомерПромо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваров.Позиции.(
	|		СУММА(Сумма) КАК СуммаИтого,
	|		СУММА(СуммаНДС) КАК СуммаНДС,
	|		СУММА(СуммаСНДС) КАК ИтогоСНДС,
	|		СУММА(РеализацияТоваров.Позиции.Количество * РеализацияТоваров.Позиции.Цена - РеализацияТоваров.Позиции.Сумма) КАК СуммаСкидки
	|	) КАК Позиции
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализацияТоваров
	|ГДЕ
	|	РеализацияТоваров.Ссылка В(&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Параметры.Вставить("НомерПромо", НомерПромо);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Выборка2 = РезультатЗапроса[1].Выбрать();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПозицииШапка = Макет.ПолучитьОбласть("ПозицииШапка");
	ОбластьПозиции = Макет.ПолучитьОбласть("Позиции");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьСпасибо = Макет.ПолучитьОбласть("Спасибо"); 
	ОбластьСайт = Макет.ПолучитьОбласть("Сайт");
	ОбластьПромо = Макет.ПолучитьОбласть("Промо");
	ОбластьКартинка = Макет.ПолучитьОбласть("Картинка");
	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	
	Пока Выборка.Следующий() Цикл 
		
		Если ВставлятьРазделительСтраниц Тогда
			
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
		
		//Область Заголовок
		ОбластьЗаголовок.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьЗаголовок);
				
		//Область Шапка
		ОбластьШапка.Параметры.Заполнить(Выборка);
        ТабДок.Вывести(ОбластьШапка, Выборка.Уровень());
				
		//Область ПозицииШапка
		ТабДок.Вывести(ОбластьПозицииШапка);
				
		//Область Позиции
		ВыборкаПозиции = Выборка.Позиции.Выбрать();
		
		Пока ВыборкаПозиции.Следующий() Цикл
			
			ОбластьПозиции.Параметры.Заполнить(ВыборкаПозиции);
			ТабДок.Вывести(ОбластьПозиции, ВыборкаПозиции.Уровень());
			
		КонецЦикла;
		
		ВставлятьРазделительСтраниц = Истина; 
		
		//Область Подвал		
		Пока Выборка2.Следующий() Цикл
			
			ВыборкаПодвал = Выборка2.Позиции.Выбрать();
			
			Пока ВыборкаПодвал.Следующий() Цикл
				
				ОбластьПодвал.Параметры.Заполнить(ВыборкаПодвал);
				
			КонецЦикла;
			
		КонецЦикла;

		ТабДок.Вывести(ОбластьПодвал);        	
		
		//Область Спасибо
		ТабДок.Вывести(ОбластьСпасибо);
				
		//Область Сайт 
		ОбластьСайт.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОбластьСайт);
				
		//Область Промо
		ОбластьПромо.Параметры.Заполнить(Выборка);
        ТабДок.Вывести(ОбластьПромо);
        	
		//Область Картинка
		ТабДок.Вывести(ОбластьКартинка);
     					
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
